app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?)  [["content", "htrtht"], ["user_id", 1], ["created_at", 2017-03-24 09:43:33 UTC], ["updated_at", 2017-03-24 09:43:33 UTC], ["picture", "kabuto.png"]]
---
  def create
    @micropost = current_user.microposts.build micropost_params
    if @micropost.save