app/controllers/password_resets_controller.rb

  def create
     @user = User.find_by email: params[:password_reset][:email].downcase
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "gdfgf@mail.com"], ["LIMIT", 1]]

  def update
    if params[:user][:password].empty?
      @user.errors.add :password, t(".empty")
      render :edit
    else
      if @user.update_attributes user_params
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$IOnublkKhivIBzYwyyR8VO3SYdu.qcHkDQj2WxCj7evx.4KlAgqDS"], ["updated_at", 2017-03-24 02:48:00 UTC], ["id", 3]]

  def find_user
    @user = User.find_by email: params[:email]
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "example-2@railstutorial.org"], ["LIMIT", 1]]