app/controllers/users_controller.rb

SELECT  "users"."id", "users"."name", "users"."email" FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.select(:id, :name, :email).paginate page: params[:page],
      per_page: Settings.page.per_page

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
  def show
    @microposts = @user.microposts.paginate page: params[:page],
      per_page: Settings.page.per_page

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new user_params
    if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 119]]
---
  def destroy
    load_user
    @user.destroy ? flash[:success] = t(".delete") : flash[:danger] = t(".error")